balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33EP512MU814.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><edc:PIC xmlns:edc="http://crownking/edc" edc:arch="33xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="DSPIC33EP512MU814" edc:procid="0x154" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Import>
    <edc:Module_import edc:modsrc="DOS-01041.Module"/>
    <edc:Module_import edc:modsrc="DOS-00794.Module"/>
    <edc:Module_import edc:modsrc="DOS-00927.Module"/>
    <edc:Module_import edc:modsrc="DOS-00931.Module"/>
    <edc:Module_import edc:modsrc="DOS-00932.Module"/>
    <edc:Module_import edc:modsrc="DOS-00942.Module"/>
    <edc:Module_import edc:modsrc="DOS-00938.Module"/>
    <edc:Module_import edc:modsrc="DOS-00996.Module"/>
    <edc:Module_import edc:modsrc="DOS-00997.Module"/>
    <edc:Module_import edc:modsrc="DOS-00998.Module"/>
    <edc:Module_import edc:modsrc="DOS-00209.Module"/>
    <edc:Module_import edc:modsrc="DOS-01198.Module"/>
    <edc:Module_import edc:modsrc="DOS-01113.Module"/>
    <edc:Module_import edc:modsrc="DOS-00999.Module"/>
    <edc:Module_import edc:modsrc="DOS-01116.Module"/>
    <edc:Module_import edc:modsrc="DOS-00828.Module"/>
    <edc:Module_import edc:modsrc="DOS-00822.Module"/>
    <edc:Module_import edc:modsrc="DOS-01017-RPORx.Module"/>
    <edc:Module_import edc:modsrc="DOS-01017-RPINRx.Module"/>
    <edc:Module_import edc:modsrc="DOS-00892.Module"/>
    <edc:Module_import edc:modsrc="DOS-00804.Module"/>
    <edc:Module_import edc:modsrc="DOS-00826.Module"/>
    <edc:Module_import edc:modsrc="DOS-01017-PMDx.Module"/>
    <edc:Module_import edc:modsrc="DOS-00933.Module"/>
    <edc:Module_import edc:modsrc="DOS-01080.Module"/>
    <edc:Module_import edc:modsrc="DOS-00929.Module"/>
    <edc:Module_import edc:modsrc="DOS-00958.Module"/>
    <edc:Module_import edc:modsrc="DOS-01117-PORTx.Module"/>
  </edc:Import>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="3.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="true" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="1000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="128" edc:rowerase="128"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="33xxxx" edc:name="33xxxx">
    <edc:MemTraits edc:extendeddataspace="PIC24EP">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0x557FE" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x557FE" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="HardTrapError" edc:desc="Generic Hard Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="DMACError" edc:desc="DMAC Error Trap vector"/>
    <edc:Trap edc:cname="SoftTrapError" edc:desc="Generic Soft Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Resereved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="Input Compare 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="Timer 1" edc:irq="3"/>
    <edc:Interrupt edc:cname="DMA0Interrupt" edc:desc="DMA Channel 0" edc:irq="4"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="Timer 2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="Timer 3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1 error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 transfer done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="AD1Interrupt" edc:desc="ADC1 Convert Done" edc:irq="13"/>
    <edc:Interrupt edc:cname="DMA1Interrupt" edc:desc="DMA Channel 1" edc:irq="14"/>
    <edc:Interrupt edc:cname="NVMInterrupt" edc:desc="NVM Interrupt" edc:irq="15"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CM1Interrupt" edc:desc="Analog Comparator Combined Interrupt" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="AD2Interrupt" edc:desc="ADC2 Convert Done" edc:irq="21"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="Input Compare 7" edc:irq="22"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="Input Compare 8" edc:irq="23"/>
    <edc:Interrupt edc:cname="DMA2Interrupt" edc:desc="DMA Channel 2" edc:irq="24"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="Timer 4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="Timer 5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2 error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 transfer done" edc:irq="33"/>
    <edc:Interrupt edc:cname="C1RxRdyInterrupt" edc:desc="ECAN1 Receive Data  Ready" edc:irq="34"/>
    <edc:Interrupt edc:cname="C1Interrupt" edc:desc="ECAN1 Event" edc:irq="35"/>
    <edc:Interrupt edc:cname="DMA3Interrupt" edc:desc="DMA Channel 3" edc:irq="36"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="Input Capture 5" edc:irq="39"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="Input Capture 6" edc:irq="40"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="Output Compare 5" edc:irq="41"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="Output Compare 6" edc:irq="42"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="Output Compare 7" edc:irq="43"/>
    <edc:Interrupt edc:cname="OC8Interrupt" edc:desc="Output Compare 8" edc:irq="44"/>
    <edc:Interrupt edc:cname="PMPInterrupt" edc:desc="PMP Interrupt" edc:irq="45"/>
    <edc:Interrupt edc:cname="DMA4Interrupt" edc:desc="DMA Channel 4" edc:irq="46"/>
    <edc:Interrupt edc:cname="T6Interrupt" edc:desc="Timer 6" edc:irq="47"/>
    <edc:Interrupt edc:cname="T7Interrupt" edc:desc="Timer 7" edc:irq="48"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="T8Interrupt" edc:desc="Timer 8" edc:irq="51"/>
    <edc:Interrupt edc:cname="T9Interrupt" edc:desc="Timer 9" edc:irq="52"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="External Interrupt 3" edc:irq="53"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="External Interrupt 4" edc:irq="54"/>
    <edc:Interrupt edc:cname="C2RxRdyInterrupt" edc:desc="ECAN2 Receive Data  Ready" edc:irq="55"/>
    <edc:Interrupt edc:cname="C2Interrupt" edc:desc="ECAN2 Event" edc:irq="56"/>
    <edc:Interrupt edc:cname="PWMSpEventMatchInterrupt" edc:desc="PWM special event match" edc:irq="57"/>
    <edc:Interrupt edc:cname="QEI1Interrupt" edc:desc="QEI1 Position Counter Compare" edc:irq="58"/>
    <edc:Interrupt edc:cname="DCIEInterrupt" edc:desc="DCI Fault Interrupt" edc:irq="59"/>
    <edc:Interrupt edc:cname="DCIInterrupt" edc:desc="DCI Transfer Done" edc:irq="60"/>
    <edc:Interrupt edc:cname="DMA5Interrupt" edc:desc="DMA Channel 5" edc:irq="61"/>
    <edc:Interrupt edc:cname="RTCCInterrupt" edc:desc="RTCC Interrupt" edc:irq="62"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="CRCInterrupt" edc:desc="CRC Generator Intrrupt" edc:irq="67"/>
    <edc:Interrupt edc:cname="DMA6Interrupt" edc:desc="DMA Channel 6" edc:irq="68"/>
    <edc:Interrupt edc:cname="DMA7Interrupt" edc:desc="DMA Channel 7" edc:irq="69"/>
    <edc:Interrupt edc:cname="C1TxReqInterrupt" edc:desc="ECAN1 Transmit Data Request" edc:irq="70"/>
    <edc:Interrupt edc:cname="C2TxReqInterrupt" edc:desc="ECAN2 Transmit Data Request" edc:irq="71"/>
    <edc:Interrupt edc:cname="PWMSecSpEventMatchInterrupt" edc:desc="PWM secondary special event match" edc:irq="73"/>
    <edc:Interrupt edc:cname="QEI2Interrupt" edc:desc="QEI2 Position Counter Compare" edc:irq="75"/>
    <edc:Interrupt edc:cname="U3ErrInterrupt" edc:desc="UART3 Error" edc:irq="81"/>
    <edc:Interrupt edc:cname="U3RXInterrupt" edc:desc="UART3 Receiver" edc:irq="82"/>
    <edc:Interrupt edc:cname="U3TXInterrupt" edc:desc="UART3 Transmitter" edc:irq="83"/>
    <edc:Interrupt edc:cname="USB1Interrupt" edc:desc="USB1 Interrupt" edc:irq="86"/>
    <edc:Interrupt edc:cname="U4ErrInterrupt" edc:desc="UART4 Error" edc:irq="87"/>
    <edc:Interrupt edc:cname="U4RXInterrupt" edc:desc="UART4 Receiver" edc:irq="88"/>
    <edc:Interrupt edc:cname="U4TXInterrupt" edc:desc="UART4 Transmitter" edc:irq="89"/>
    <edc:Interrupt edc:cname="SPI3ErrInterrupt" edc:desc="SPI3 error" edc:irq="90"/>
    <edc:Interrupt edc:cname="SPI3Interrupt" edc:desc="SPI3 transfer done" edc:irq="91"/>
    <edc:Interrupt edc:cname="OC9Interrupt" edc:desc="Output Compare 9" edc:irq="92"/>
    <edc:Interrupt edc:cname="IC9Interrupt" edc:desc="Input Capture 9" edc:irq="93"/>
    <edc:Interrupt edc:cname="PWM1Interrupt" edc:desc="PWM1 Interrupt" edc:irq="94"/>
    <edc:Interrupt edc:cname="PWM2Interrupt" edc:desc="PWM2 Interrupt" edc:irq="95"/>
    <edc:Interrupt edc:cname="PWM3Interrupt" edc:desc="PWM3 Interrupt" edc:irq="96"/>
    <edc:Interrupt edc:cname="PWM4Interrupt" edc:desc="PWM4 Interrupt" edc:irq="97"/>
    <edc:Interrupt edc:cname="PWM5Interrupt" edc:desc="PWM5 Interrupt" edc:irq="98"/>
    <edc:Interrupt edc:cname="PWM6Interrupt" edc:desc="PWM6 Interrupt" edc:irq="99"/>
    <edc:Interrupt edc:cname="PWM7Interrupt" edc:desc="PWM7 Interrupt" edc:irq="100"/>
    <edc:Interrupt edc:cname="DMA8Interrupt" edc:desc="DMA Channel 8" edc:irq="118"/>
    <edc:Interrupt edc:cname="DMA9Interrupt" edc:desc="DMA Channel 9" edc:irq="119"/>
    <edc:Interrupt edc:cname="DMA10Interrupt" edc:desc="DMA Channel 10" edc:irq="120"/>
    <edc:Interrupt edc:cname="DMA11Interrupt" edc:desc="DMA Channel 11" edc:irq="121"/>
    <edc:Interrupt edc:cname="SPI4ErrInterrupt" edc:desc="SPI4 error" edc:irq="122"/>
    <edc:Interrupt edc:cname="SPI4Interrupt" edc:desc="SPI4 transfer done" edc:irq="123"/>
    <edc:Interrupt edc:cname="OC10Interrupt" edc:desc="Output Compare 10" edc:irq="124"/>
    <edc:Interrupt edc:cname="IC10Interrupt" edc:desc="Input Capture 10" edc:irq="125"/>
    <edc:Interrupt edc:cname="OC11Interrupt" edc:desc="Output Compare 11" edc:irq="126"/>
    <edc:Interrupt edc:cname="IC11Interrupt" edc:desc="Input Capture 11" edc:irq="127"/>
    <edc:Interrupt edc:cname="OC12Interrupt" edc:desc="Output Compare 12" edc:irq="128"/>
    <edc:Interrupt edc:cname="IC12Interrupt" edc:desc="Input Capture 12" edc:irq="129"/>
    <edc:Interrupt edc:cname="DMA12Interrupt" edc:desc="DMA Channel 12" edc:irq="130"/>
    <edc:Interrupt edc:cname="DMA13Interrupt" edc:desc="DMA Channel 13" edc:irq="131"/>
    <edc:Interrupt edc:cname="DMA14Interrupt" edc:desc="DMA Channel 14" edc:irq="132"/>
    <edc:Interrupt edc:cname="OC13Interrupt" edc:desc="Output Compare 13" edc:irq="134"/>
    <edc:Interrupt edc:cname="IC13Interrupt" edc:desc="Input Capture 13" edc:irq="135"/>
    <edc:Interrupt edc:cname="OC14Interrupt" edc:desc="Output Compare 14" edc:irq="136"/>
    <edc:Interrupt edc:cname="IC14Interrupt" edc:desc="Input Capture 14" edc:irq="137"/>
    <edc:Interrupt edc:cname="OC15Interrupt" edc:desc="Output Compare 15" edc:irq="138"/>
    <edc:Interrupt edc:cname="IC15Interrupt" edc:desc="Input Capture 15" edc:irq="139"/>
    <edc:Interrupt edc:cname="OC16Interrupt" edc:desc="Output Compare 16" edc:irq="140"/>
    <edc:Interrupt edc:cname="IC16Interrupt" edc:desc="Input Capture 16" edc:irq="141"/>
    <edc:Interrupt edc:cname="ICDInterrupt" edc:desc="ICD Application" edc:irq="142"/>
    <edc:Interrupt edc:cname="JTAGInterrupt" edc:desc="JTAG Programming" edc:irq="143"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0xA" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x200" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x55800" edc:regionid="program"/>
    <edc:AuxCodeSector edc:beginaddr="0x7FC000" edc:endaddr="0x7FFFFA" edc:regionid="auxflash"/>
    <edc:AuxVectorSector edc:beginaddr="0x7FFFFA" edc:endaddr="0x7FFFFC" edc:regionid="auxvector"/>
    <edc:AuxResetSector edc:beginaddr="0x7FFFFC" edc:endaddr="0x800000" edc:regionid="auxreset"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x801000" edc:regionid="testmem"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80004" edc:endaddr="0xf80012" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="----------nn--nn" edc:cname="FGS" edc:default="0xffffcf" edc:desc="" edc:impl="0x33" edc:name="FGS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x03">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Segment Write-Protect bit" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="General Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="General Segment is write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS" edc:desc="General Segment Code-Protect bit" edc:mask="0x1" edc:name="GSS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="General Segment Code protect is disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="Standard Security Code protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x55800"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="GSSK" edc:desc="General Segment Key bits" edc:mask="0x3" edc:name="GSSK" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="General Segment Write Protection or Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="General Segment Write Protection and Code Protection is Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
